<a href="https://colab.research.google.com/github/Sid-Yo/Python-for-data-science/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

#Data given to the dataframe can be of any form

print('Data passed as dictionary')
dict_df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
print(dict_df)

Data passed as dictionary
   A  B
0  1  4
1  2  5
2  3  6

In [ ]:
print('Data pass as list')
dict_lst = pd.DataFrame([1,2,3,4])
print(dict_lst)

Data pass as list
   0
0  1
1  2
2  3
3  4

In [ ]:
print('Data passed as list of list')
dict_llst = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]])
print(dict_llst)

Data passed as list of list
      0   1
0  May1  32
1  May2  35
2  May3  40
3  May4  50

In [ ]:
print('Data passed as list of dict')
dict_ldf = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10}])
print(dict_ldf)

Data passed as list of dict
   a   b
0  1   2
1  5  10

In [ ]:
print('Changing the datatype to float with dtype setter to float')
dict_ldf = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10}],dtype=float)
print(dict_ldf)
print('Getting the column names')
print(dict_ldf.columns)

Changing the datatype to float with dtype setter to float
     a     b
0  1.0   2.0
1  5.0  10.0
Getting the column names
Index(['a', 'b'], dtype='object')

In [ ]:
print('Renaming the column')
dict_ldf.rename(columns={'a':'A','b':'B'},inplace=True)
dict_ldf

Renaming the column

     A     B
0  1.0   2.0
1  5.0  10.0

# NaN
- Column wise NaN
- Row wise NaN
- Check whether NaN exists
- Count how many NaN exists
- How to deal with NaN

In [ ]:
dict_col_nan = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10,'c':20}])
print(dict_col_nan)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [ ]:
dict_row_nan = pd.DataFrame({"A": pd.Series([1, 2, 3],dtype = float), "B": pd.Series([4, 5, 6,9],dtype=float)})
print(dict_row_nan)

     A    B
0  1.0  4.0
1  2.0  5.0
2  3.0  6.0
3  NaN  9.0

In [ ]:
print('To check whether dataframe has null values?')
#We use isnull function to check it
print(dict_row_nan.isnull())

To check whether dataframe has null values?
       A      B
0  False  False
1  False  False
2  False  False
3   True  False

In [ ]:
print(dict_row_nan.isnull().sum(axis=0))

A    1
B    0
dtype: int64

In [ ]:
#As in dictionary key becomes column, so if we do not match up the 'columns' with keys it will show the those columns as NaN
dict_ldf = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10,'c':20}],columns=['A','B','c'])
print(dict_ldf)

    A   B     c
0 NaN NaN   NaN
1 NaN NaN  20.0

In [ ]:
print('Correct column will fill in values')

dict_ldf = pd.DataFrame([{'a': 1, 'b': 2},{'a': 5, 'b': 10,'c':20}],columns=['a','b','c'])
print(dict_ldf)

Correct column will fill in values
   a   b     c
0  1   2   NaN
1  5  10  20.0

# Column and Indexes
In case of dictionary the keys would act as columns but in lists, the column names if not specified will start as '0'-1st column, '1'-2nd Column and so on The left most side of the dataframe is called as index, it's starts default with index 0

In [ ]:
dict_llst = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]],index = ['Day1','Day2','Day3','Day4'])
dict_llst

         0   1
Day1  May1  32
Day2  May2  35
Day3  May3  40
Day4  May4  50

In [ ]:
print('Changing column name while defining the dataframe')
dict_llst = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]],index = ['Day1','Day2','Day3','Day4'],columns = ['May','Temperature'])
dict_llst

Changing column name while defining the dataframe

       May  Temperature
Day1  May1           32
Day2  May2           35
Day3  May3           40
Day4  May4           50

In [ ]:
dict_llst = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]],columns = ['May','Temperature'])
dict_llst=dict_llst.set_index('May')
dict_llst

      Temperature
May
May1           32
May2           35
May3           40
May4           50

In [ ]:
dict_llst.reset_index(drop=False,inplace=True)
dict_llst

    May  Temperature
0  May1           32
1  May2           35
2  May3           40
3  May4           50

# Manipulation with Data
- Accessing
- Adding new columns
- Adding columns with cool tricks
- Deleting columns

In [ ]:
df = pd.DataFrame([['May1',32],['May2',35],['May3',40],['May4',50]],index = ['Day1','Day2','Day3','Day4'],columns = ['May','Temperature'])
df

       May  Temperature
Day1  May1           32
Day2  May2           35
Day3  May3           40
Day4  May4           50

In [ ]:
print('Accessing whole column by its name')
df['Temperature']

Accessing whole column by its name

Day1    32
Day2    35
Day3    40
Day4    50
Name: Temperature, dtype: int64

In [ ]:
print('Adding Column with and without index see the diff')
add_column = pd.Series(['Charni Rd','Grant Rd','Marine Lines','Churchgate'],index=['Day1','Day2','Day3','Day4'])
df['Stations'] = add_column
df

Adding Column with and without index see the diff

       May  Temperature      Stations
Day1  May1           32     Charni Rd
Day2  May2           35      Grant Rd
Day3  May3           40  Marine Lines
Day4  May4           50    Churchgate

In [ ]:
print('Use existing Column to create new column')

df['Wind Speed'] = df['Temperature']*0.414
df

Use existing Column to create new column

       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700

In [ ]:
print('Addition of two column, having same dtype')

df['Add_Temp_Wind'] = df['Temperature'] + df['Wind Speed']
df

Addition of two column, having same dtype

       May  Temperature      Stations  Wind Speed  Add_Temp_Wind
Day1  May1           32     Charni Rd      13.248         45.248
Day2  May2           35      Grant Rd      14.490         49.490
Day3  May3           40  Marine Lines      16.560         56.560
Day4  May4           50    Churchgate      20.700         70.700

In [ ]:
print('Deleting columns from dataframe')
del df['Add_Temp_Wind']
df

Deleting columns from dataframe

       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700

In [ ]:
df['Add_Temp_Wind'] = df['Temperature'] + df['Wind Speed']
print(df)
df.pop('Add_Temp_Wind')
df

       May  Temperature      Stations  Wind Speed  Add_Temp_Wind
Day1  May1           32     Charni Rd      13.248         45.248
Day2  May2           35      Grant Rd      14.490         49.490
Day3  May3           40  Marine Lines      16.560         56.560
Day4  May4           50    Churchgate      20.700         70.700

       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700

In [ ]:
df['Add_Temp_Wind'] = df['Temperature'] + df['Wind Speed']
df.drop('Add_Temp_Wind',axis=1,inplace=True)
df

       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700

In [ ]:
#Drop row of a dataframe
#use drop function and pass the indexed index or name of that index
df.drop(df.index[0])

       May  Temperature      Stations  Wind Speed
Day2  May2           35      Grant Rd       14.49
Day3  May3           40  Marine Lines       16.56
Day4  May4           50    Churchgate       20.70

In [ ]:
df.drop(df.index[[0,1,2]])

       May  Temperature    Stations  Wind Speed
Day4  May4           50  Churchgate        20.7

In [ ]:
df.drop('Day1',axis=0)

       May  Temperature      Stations  Wind Speed
Day2  May2           35      Grant Rd       14.49
Day3  May3           40  Marine Lines       16.56
Day4  May4           50    Churchgate       20.70

In [ ]:
df

       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700

# Use of loc and iloc

In [ ]:
print(type(df.iloc[1]))

<class 'pandas.core.series.Series'>

In [ ]:
print('range of index wise selection in discrete manner\n')
print(df.iloc[[1,2,3]])

print('\nPartial selection column wise and row wise')
print(df.iloc[0:3,0:3])

print('\nComplete row wise and partial column wise')
print(df.iloc[:,0:3])

range of index wise selection in discrete manner

       May  Temperature      Stations  Wind Speed
Day2  May2           35      Grant Rd       14.49
Day3  May3           40  Marine Lines       16.56
Day4  May4           50    Churchgate       20.70

Partial selection column wise and row wise
       May  Temperature      Stations
Day1  May1           32     Charni Rd
Day2  May2           35      Grant Rd
Day3  May3           40  Marine Lines

Complete row wise and partial column wise
       May  Temperature      Stations
Day1  May1           32     Charni Rd
Day2  May2           35      Grant Rd
Day3  May3           40  Marine Lines
Day4  May4           50    Churchgate

In [ ]:
df

       May  Temperature      Stations  Wind Speed
Day1  May1           32     Charni Rd      13.248
Day2  May2           35      Grant Rd      14.490
Day3  May3           40  Marine Lines      16.560
Day4  May4           50    Churchgate      20.700

In [ ]:
print('\nPartial row wise and partial column wise')
print(df.iloc[[1,0,2],:])
print('='*40)

print('\nGet single value')
print(df.iloc[0,0])
print('='*40)

print('\nChanging that value')
df.iloc[0,0] = 'May11'
print(df.iloc[0,0])

Partial row wise and partial column wise
       May  Temperature      Stations  Wind Speed
Day2  May2           35      Grant Rd      14.490
Day1  May1           32     Charni Rd      13.248
Day3  May3           40  Marine Lines      16.560
========================================

Get single value
May1
========================================

Changing that value
May11

In [ ]:
print(df)
print('\nChanging entire row')
df.iloc[0] = ['May1',35,'Charni Road',15.63]
print(df)

        May  Temperature      Stations  Wind Speed
Day1  May11           32     Charni Rd      13.248
Day2   May2           35      Grant Rd      14.490
Day3   May3           40  Marine Lines      16.560
Day4   May4           50    Churchgate      20.700

Changing entire row
       May  Temperature      Stations  Wind Speed
Day1  May1           35   Charni Road       15.63
Day2  May2           35      Grant Rd       14.49
Day3  May3           40  Marine Lines       16.56
Day4  May4           50    Churchgate       20.70

In [ ]:
#loc is label-based, which means that we have to specify the name of the rows and columns that we need to filter out.
#pass columN names and not indexes
import numpy as np

data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [ ]:
#Partial column
print(data.loc[:,['age','section']])
#Partial row
print(data.loc[0:3,:])

   age section
0   10       A
1   22       B
2   13       C
3   21       B
4   12       B
5   11       A
6   17       A
   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN

In [ ]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [ ]:
#single
print(data.loc[data['age'] >= 15])
#Mutiple conditions
print(data.loc[(data['age'] >= 12) & (data['gender'] == 'M')])

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red
   age section    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black